In [1]:
import pandas as pd
from sqlalchemy import create_engine
import sqlite3 as sq

In [2]:
rds_connection_string = "postgres:postgres@localhost:5432/nationalScores"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [3]:
engine.table_names()

['male_math', 'female_math', 'male_reading', 'female_reading']

In [5]:
pd.read_sql_query('select * from male_math', con=engine).head()

,id,state,gender,avg_2009_mathScores,avg_2017_mathScores,mathScores_precentChange
0,1,AK,Male,238.445992,230.451760,7.994232
1,3,AL,Male,227.718193,232.458570,-4.740377
2,5,AR,Male,238.824583,234.980702,3.843880
3,7,AZ,Male,230.283950,235.631656,-5.347706
4,9,CA,Male,232.613832,233.265686,-0.651854